In [1]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd
a=pd.Series([4,8,15,16,23,42])
a

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
b=[1,2,3,4,5,6,7,8,9,10]
pd.Series(b)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [6]:
#Q3. Create a Pandas DataFrame that contains the following data:

In [18]:
data={"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
a=pd.DataFrame(data)
a

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [19]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [20]:
# A DataFrame in pandas is a two-dimensional, tabular data structure with labeled axes (rows and columns), while a pandas Series is a one-dimensional labeled array; the main distinction lies in their dimensions—DataFrame is for two-dimensional data, and Series is for one-dimensional data.

In [21]:
#Series
import pandas as pd
a=pd.Series([4,8,15,16,23,42])
a

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [22]:
#DataFrame

In [23]:
data={"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
a=pd.DataFrame(data)
a

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [24]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

In [25]:
data={"Name":["Alice","Bob","Claire","vamshi","hemesh","red"],"Age":[25,30,27,20,20,20],"Gender":["Female","Male","Female","Male","Male","Male"]}
a=pd.DataFrame(data)
a.head(3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [26]:
a.tail(3)

     Name  Age Gender
3  vamshi   20   Male
4  hemesh   20   Male
5     red   20   Male

In [27]:
a.describe()

             Age
count   6.000000
mean   23.666667
std     4.320494
min    20.000000
25%    20.000000
50%    22.500000
75%    26.500000
max    30.000000

In [28]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Gender  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [29]:
a.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [30]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [31]:
# In pandas, both Series and DataFrame are mutable, meaning you can modify their contents after creation.

In [32]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [33]:
import pandas as pd


series1 = pd.Series([1, 2, 3], name='Column_A')
series2 = pd.Series(['a', 'b', 'c'], name='Column_B')


df = pd.DataFrame({series1.name: series1, series2.name: series2})


print(df)

   Column_A Column_B
0         1        a
1         2        b
2         3        c